# LoadClassification Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalEquipmentLoadData..::..LoadClassification Property
AnalyticalEquipmentLoadData Class See Also
---
The load classification of analytical equipment load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElementId LoadClassification { get; set; }
```

Visual Basic
---
```text
Public Property LoadClassification As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ LoadClassification {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The id is not a load classification id . |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace